package com.sf.wdx.resource;

import java.util.ArrayList;
import java.util.List;

import com.sf.wdx.domain.Song;

/**
 * 描述：歌曲资源
 * @author 80002888
 * @date   2018年8月13日
 */
public class SongResource {
	
	private static List<Song> songList;
	
	static {
		songList = new ArrayList<>();
		songList.add(new Song("伤害", "玺晨", "卓越", "周杰", "光棍情歌", "不知道你还记不记得那天的烟火坠落的很寂寞不知道你还爱不爱我只因那天的分手说的太坚决又到了 这个伤人的季节外面下着雪心却在滴着血回忆在一点一滴的堆叠为何对你的爱永远不磨灭多少爱能从来 抛开曾经伤害还可以肆无忌惮的爱 忘了未来多少爱能从来 当心以被撕开在痴心的等待 也拼不回破碎的爱又到了 这个伤人的季节外面下着雪心却在滴着血回忆在一点一滴的堆叠为何对你的爱永远不磨灭多少爱能从来 抛开曾经伤害还可以肆无忌惮的爱 忘了未来多少爱能从来 当心以被撕开在痴心的等待 也拼不回......多少爱能从来抛开曾经伤害还可以肆无忌惮的爱 忘了未来多少爱能从来 当心以被撕开在痴心的等待 也拼不回破碎的爱"));
		songList.add(new Song("伤害", "李贵府", "周杰", "李贵府", "单曲", "也许是不小心的话也许是不小心的话也许是不经意的事情也许是不经意的事情都伤害了两个人的心都伤害了两个人的心也许是你爱的方式也许是你爱的方式也许是你害怕失去也许是你害怕失去都伤害了彼此的感情都伤害了彼此的感情你伤害了我伤害了你你伤害了我伤害了你你伤害了我伤害了你你伤害了我伤害了你你伤害了我伤害了你你伤害了我伤害了你伤害了我们的爱情伤害了我们的爱情伤害了我们的爱情也许是不经意的话也许是不经意的话也许是不经意的话可却伤害两个人的心可却伤害两个人的心可却伤害两个人的心伤害了已往的过去伤害了已往的过去伤害了已往的过去也许你害怕失去也许你害怕失去也许你害怕失去可却伤害了啊这一份感情可却伤害了啊这一份感情可却伤害了啊这一份感情可却伤害了啊 这一份感情"));
		songList.add(new Song("伤害我还说爱我", "范三妹", "顾雄", "周杰伦", "伤害我还说爱我", "你伤害我 还说爱我 这不是我要的结果放开的手 就不要再次拉扯 哦 痛过的伤口我最爱的那个人 如今是我最伤心的人我最爱的那个人 如今是我最伤心的人伤已被你伤了太多 爱早已渐渐模糊伤已被你伤了太多 爱早已渐渐模糊痛 痛到内心深处 你的背叛刺进我心中痛 痛到内心深处 你的背叛刺进我心中爱 请不要再对我说 你撕碎我的梦爱 请不要再对我说 你撕碎我的梦你伤害我 还说爱我 这不是我要的结果你伤害我 还说爱我 这不是我要的结果放开的手 就不要再次拉扯 哦 痛过的伤口放开的手 就不要再次拉扯 哦 痛过的伤口你伤害我 还抱紧我 我不是你手中玩偶你伤害我 还抱紧我 我不是你手中玩偶你伤害我 还抱紧我 我不是你手中玩偶爱的承诺 早被你无情带走 你说什么爱我爱的承诺 早被你无情带走 你说什么爱我爱的承诺 早被你无情带走 你说什么爱我别说爱我别说爱我别说爱我这不是我要的结果痛过的伤口"));
		songList.add(new Song("伤害我的人只配哭泣", "储维", "储维", "周杰伦", "我们的诗", "不是我太自信不是我太矫情但我知道伤害我的人就只配哭泣用心去爱你凭什么被你欺骗别以为你自己有那么的了不起带着你的虚伪离开我的内心我会找到比你好百几倍的爱情看着你有点泛酸又不自在的神情原谅我自私的泛出一点点得意带着你的委屈离开我的内心伤害我的人就只配哭泣哦~看着你有点泛酸又不自在的神情有那么的了不起不是我太自信不是我太矫情但我知道伤害我的人就只配哭泣用心去爱你凭什么被你欺骗别以为你自己有那么的了不起带着你的虚伪离开我的内心我会找到比你好百几倍的爱情看着你有点泛酸又不自在的神情原谅我自私的泛出一点点得意带着你的委屈离开我的内心伤害我的人就只配哭泣哦~看着你有点泛酸又不自在的神情有那么的了不起"));
		songList.add(new Song("伤害自己成全她", "郎A", "郎A", "郎A", "无病呻吟", "第一次见你的时候我相信了一见钟情可我已向你许下承诺请你不要拒绝我的感情你知道你在我心中就是天使的美才让我爱你爱的那么干脆如果有一天你若离我远走而飞我宁愿为你变得伤痕累累我为了一个女人放弃自已想要的生活我为了一个女人独自流浪在茫茫的狂野中我为了一个女人付出内心善良的灵魂我为了一个女人伤害了自已成全了她们第一次见你的时候我相信了一见钟情可我已向你许下承诺请你不要拒绝我的感情你知道你在我心中就是天使的美才让我爱你爱的那么干脆如果有一天你若离我远走而飞我宁愿为你变得伤痕累累我为了一个女人放弃自已想要的生活我为了一个女人独自流浪在茫茫的狂野中我为了一个女人付出内心善良的灵魂我为了一个女人伤害了自已成全了她们我为了一个女人放弃自已想要的生活我为了一个女人独自流浪在茫茫的狂野中我为了一个女人付出内心善良的灵魂我为了一个女人伤害了自已成全了她们我为了一个女人放弃自已想要的生活我为了一个女人独自流浪在茫茫的狂野中我为了一个女人付出内心善良的灵魂我为了一个女人伤害了自已成全了她们"));
		songList.add(new Song("无心伤害", "泳儿", "周杰伦", "背叛者", "风情歌", "真心无奈 多心都为了爱我坐在这 傻傻的发呆我仍依赖 你纯纯的爱我心还在 爱你的人还在苦苦等 想哭哭不出来无心伤害 你应该明白爱太多空隙 受伤容易互信互爱才是唯一对你的付出 都放在心里我始终这样珍惜 我怎么会忘记Feel so sorry baby I'm so sorryI never meant I never meant to hurt you无心伤害 你应该明白Feel so lonely baby I'm so lonelyDo you know I need you to come backAre you alright 请快点回来）真心仍在 与你永不分开这一生 只愿和你相爱与你同在 只为你等待爱是纯真 爱是无恨不在乎怎么会 痛苦万分我真的太笨 不懂心疼Baby please come back oh yFeel so sorry baby I'm so sorryI never meant I never meant to hurt you无心伤害 你应该明白Feel so lonely baby I'm so lonelyDo you know I need you to come backAre you alright 请快点回来Feel so sorry baby I'm so sorryI never meant I never meant to hurt you无心伤害 你应该明白Feel so lonely baby I'm so lonelyDo you know I need you to come backAre you alright I miss you tonight"));
		songList.add(new Song("背叛", "张信哲", "王中言", "张信哲", "唱泳音乐世界", "你剪去长发 变得不爱说话周末的夜晚不在家正在失去的感觉 悄悄漫延你却以为我没发现你擦的香水 洋溢陌生的甜我沉默以对的危险是谁侵略你那曾经执著的眼抹去从前 渐行渐远背叛美丽誓约 眼看温柔毁灭你在撕裂我无力的心要你看著我的眼睛 亲口宣叛结局别说不忍心你擦的香水 洋溢陌生的甜我沉默以对的危险是谁侵略你那曾经执著的眼抹去从前 渐行渐远背叛美丽誓约 眼看温柔毁灭你在撕裂我无力的心要你看著我的眼睛 亲口宣叛结局别说不忍心背叛不需证据 爱情失去魔力就让你撕裂我无奈的心如果你将离去 不要发出任何声音别把梦惊醒如果你将离去 不要发出任何声音别把梦惊醒"));
		songList.add(new Song("背叛", "邓子霆", "深橙黑橘、李汉群", "深橙黑橘", "坏习惯", "时间若没有终点 后悔就无限蔓延已经失效的信件 写满对你的思念再爱一个人 多伤一个人 背叛像末日无法预言 你总是突然出现欺骗上演太多回 这次微笑说再见我依然不安 却假装习惯 孤单在每个伤过的夜里 被困在黑暗的熟悉在下雨的冬天 你哭红的双眼别过了我的侧脸在每个释怀的夜里 仅存着声声的叹息在下一个黎明 反覆地回忆越走越远的你时间若没有终点 后悔就无限蔓延已经失效的信件 写满对你的思念再爱一个人 多伤一个人 背叛像末日无法预言 你总是突然出现欺骗上演太多回 这次微笑说再见我依然不安 却假装习惯 孤单在每个伤过的夜里 被困在黑暗的熟悉在下雨的冬天 你哭红的双眼别过了我的侧脸在每个释怀的夜里 仅存着声声的叹息在下一个黎明 反覆地回忆越走越远的你时间若没有终点 后悔就无限蔓延已经失效的信件 写满对你的思念再爱一个人 多伤一个人 背叛"));
		songList.add(new Song("背叛自己", "邰正宵", "潘丽玉", "周杰", "一千零一夜", "你的泪水最能让我认输我不在乎理智变盲目你灿烂的笑容都让我多嫉妒我为了你爱的多辛苦情到了深处原来悲喜也麻木来不及挣脱一切束缚背叛自己任由你摆布你的心为何吝啬付出我的深情你怎么忍心一再辜负-music-你的泪水最能让我认输我不在乎理智变盲目你灿烂的笑容都让我多嫉妒我为了你爱的多辛苦情到了深处原来悲喜也麻木背叛自己任由你摆布你的心为何吝啬付出我的深情你怎么忍心一再辜负背叛自己情愿是孤独我的心早已不由自主你的世界为何非要逼我退出-music-来不及挣脱一切束缚背叛自己任由你摆布你的心为何吝啬付出我的深情你怎么忍心一再辜负背叛自己情愿是孤独你的世界为何非要逼我退出我的心早已不由自主你的世界为何非要逼我退出"));
		songList.add(new Song("离别", "阿杜", "林秋离", "熊美玲", "天黑", "深情吻住了你的嘴却无能停止你的流泪这一刻我的心和你一起碎大雨下疯了的长夜沉睡的人们毫无知觉突然恨透这个世界因为要离别就走破这双鞋我陪你走一夜直到心不再滴血而你流尽泪水天空不停的闪着雷照不亮我心中黑黑黑黑黑的一切希望都早已经破灭我和你要离别离别深情吻住了你的嘴却无能停止你的流泪这一刻我的心和你一起碎大雨下疯了的长夜沉睡的人们毫无知觉突然恨透这个世界因为要离别就走破这双鞋我陪你走一夜直到心不再滴血而你流尽泪水天空不停的闪着雷照不亮我心中黑黑黑黑黑黑......就走破这双鞋我陪你走一夜直到心不再滴血而你流尽泪水天空不停的闪着雷照不亮我心中黑黑黑黑黑的一切希望都早已经破灭我和你 要离别离别"));
		songList.add(new Song("傻的可以", "林建良", "小宇", "范玮琪", "F One", "天气放晴了 心为何还如此骚动没有人经过 我却以为你在喊我原来都只是个美梦 醒来头痛曾经你爱我 爱的那么卿卿我我如今只剩我 一个人看爱情小说我自己傻傻坐在这 没有角色我真傻得可以 在你的世界里困住自己 也毫不犹豫把理智都忘记 小情话最动听什么年纪 还傻的可以oh 傻的可以 达拉达拉达...傻的可以 达拉达拉达...曾经你爱我 爱的那么卿卿我我如今只剩我 一个人看爱情小说我自己傻傻坐在这 没有角色我真傻得可以 在你的世界里困住自己 也毫不犹豫把理智都忘记 小情话最动听什么年纪 还傻的可以我真傻得可以 在你的世界里困住自己 也毫不犹豫把理智都忘记 小情话最动听什么年纪 还傻的可以达拉达拉达拉...达拉达拉达拉..."));
		songList.add(new Song("你还要我怎样", "薛之谦", "薛之谦", "薛之谦", "意外", "你停在了这条我们熟悉的街把你准备好的台词全念一遍我还在逞强说着谎也没能力遮挡你去的方向至少分开的时候我落落大方我后来都会选择绕过那条街又多希望在另一条街能遇见思念在逞强不肯忘怪我没能力跟随你去的方向若越爱越被动越要落落大方你还要我怎样要怎样你突然来的短信就够我悲伤我没能力遗忘你不用提醒我哪怕结局就这样我还能怎样能怎样最后还不是落得情人的立场你从来不会想我何必这样我慢慢的回到自己的生活圈也开始可以接触新的人选爱你到最后 不痛不痒留言在计较 谁爱过一场我剩下一张 没后悔的模样你还要我怎样 要怎样你千万不要在我婚礼的现场我听完你爱的歌 就上了车爱过你很值得我不要你怎样 没怎样我陪你走的路你不能忘因为那是我 最快乐的时光后来我的生活还算理想没为你落到孤单的下场有一天晚上 梦一场你白发苍苍 说带我流浪我还是没犹豫 就随你去天堂不管能怎样 我能陪你到天亮"));
		songList.add(new Song("演员", "薛之谦", "薛之谦", "薛之谦", "初学者", "简单点说话的方式简单点递进的情绪请省略你又不是个演员别设计那些情节没意见我只想看看你怎么圆你难过的太表面像没天赋的演员观众一眼能看见该配合你演出的我演视而不见在逼一个最爱你的人即兴表演什么时候我们开始收起了底线顺应时代的改变看那些拙劣的表演可你曾经那么爱我干嘛演出细节我该变成什么样子才能延缓厌倦原来当爱放下防备后的这些那些才是考验没意见你想怎样我都随便你演技也有限又不用说感言分开就平淡些该配合你演出的我演视而不见别逼一个最爱你的人即兴表演什么时候我们开始没有了底线顺着别人的谎言被动就不显得可怜可你曾经那么爱我干嘛演出细节我该变成什么样子才能配合出演原来当爱放下防备后的这些那些都有个期限其实台下的观众就我一个其实我也看出你有点不舍场景也习惯我们来回拉扯还计较着什么其实说分不开的也不见得其实感情最怕的就是拖着越演到重场戏越哭不出了是否还值得该配合你演出的我尽力在表演像情感节目里的嘉宾任人挑选如果还能看出我有爱你的那面请剪掉那些情节让我看上去体面可你曾经那么爱我干嘛演出细节不在意的样子是我最后的表演是因为爱你我才选择表演 这种成全"));
		songList.add(new Song("A.I.N.Y. （Live Piano Version）", "G.E.M.邓紫棋", "刘卓辉", "黄家驹", "The Best of G.E.M. 2008-2012(G.E.M.首张精选专辑)", "分开以後每个晚上格外的寂静滴答滴答剩大钟在陪着我回忆电话里头曾经是你最温柔的声音现在只有空气冷漠地回应OH给你我的心能否请你别遗弃一句爱你爱你爱你爱你能否再也不分离OH给你我的心爲什麽你却给了我孤寂就算爱你爱你爱你爱你可能你也不想聼你的拥抱曾经是最温暖最熟悉现在换了谁安睡在你胸口的位置你的承诺曾是一种不自觉的甜蜜现在一划一笔 刺在我心里OH 给你我的心 能否请你别遗弃一句爱你爱你爱你爱你 能否再也不分离OH 给你我的心 爲什麽你却给了我孤寂就算爱你爱你爱你爱你 可能你也不想聼回忆 对你最後的回忆 (回忆 最後的回忆)是你 慢慢走远的身影 (是你走远的身影)然後你 离开了没有痕迹 (然後你 离开)然後我 崩溃了放纵哭泣 (然後我 哭泣)恨你恨你 (每当我想起你) 每当我想起曾经.....还是爱你爱你爱你爱你 难道还不能清醒OH 给你我的心 能否请你别遗弃一句爱你爱你爱你爱你 能否再也不分离OH 给你我的心 爲什麽你却给了我孤寂就算爱你爱你爱你爱你 可能你也不想聼Your confession remains to be my final pleading,But the only thing that’s here with me is tic tac tic tac tic tac tic tac"));
		songList.add(new Song("Lover", "邓紫棋", "刘卓辉", "黄家驹", "星空下的背叛", "盼望你没有为我又再渡暗中淌泪我不想留底你的心空虚盼望你别再让我象背负太深的罪我的心如水你不必痴醉哦你可知谁甘心归去你与我之间有谁是缘是情是童真还是意外有泪有罪有付出还有忍耐是人是墙是寒冬藏在眼内有日有夜有幻想没法等待盼望我别去后会共你在远方相聚每一天望海每一天相对盼望你现已没有让我别去的恐惧我即使离开你的天空里哦你可知谁甘心归去你与我之间有谁是缘是情是童真还是意外有泪有罪有付出还有忍耐是人是墙是寒冬藏在眼内有日有夜有幻想没法等待多少春秋风雨改多少崎岖不变爱多少唏嘘的你在人海是缘是情是童真还是意外有泪有罪有付出还有忍耐是人是墙是寒冬藏在眼内有日有夜有幻想无法等待是缘是情是童真还是意外有泪有罪有付出还有忍耐是人是墙是寒冬藏在眼内有日有夜有幻想没法等待"));
		songList.add(new Song("布拉格广场", "蔡依林、周杰伦", "方文山", "周杰伦", "看我72变", "琴键上透着光彩绘的玻璃窗装饰着歌特式教堂谁谁谁弹一段一段流浪忧伤顺着琴声方向看见蔷薇依附十八世纪的油画上在旁静静欣赏在想你的浪漫在看是否多久都一样aafushouaafushouyapsososorrysososoModeratoAndantinoPortmentoFortissimo盗贼他偷走修道士说No梦醒来后我一切都都没有我就站在布拉格黄昏的广在许愿池投下了希望那群白鸽背对着夕阳那画面太美我不敢看布拉格的广场无人的走廊我一个人跳着舞旋转不远地方你远远吟唱没有我你真的不习惯透着光彩绘的玻璃窗装饰着歌特式教堂谁谁谁弹一段一段流浪忧伤顺着琴声方向看见蔷薇依附十八世纪的油画上在旁 静静欣赏在想 你的浪漫在看 是否多久都一a a fu shou a a fu shouyapsososorrysososoModeratoAndantinoPortmentoFortissimo盗贼他偷走修道士说No梦醒来后我一切都都没有我就站在布拉格黄昏的广场在许愿池投下了希望那群白鸽背对着夕阳那画面太美我不敢看布拉格的广场无人的走廊我一个人跳着舞旋转不远地方你远远吟唱没有我你真的不习在布拉格黄昏的广场在许愿池投下了希望那群白鸽背对着夕阳那画面太美我不敢看布拉格的广场拥挤的剧场安静小巷一家咖啡馆我在结帐你在煮浓汤这是故事最后的答案"));
		songList.add(new Song("倒带", "蔡依林", "方文山", "周杰伦", "Hitto!!超人气偶像剧主题曲精选", "我受够了等待你所谓的安排说的未来到底多久才来总是要来不及才知道我可爱我想依赖而你却都不在应该开心的地带你给的全是空白一个人假日发呆找不到人陪我看海我在幸福的门外却一直都进不来你累积给的伤害我是真的很难释怀终于看开爱回不来而你总是太晚明白最后才把话说开哭着求我留下来终于看开爱回不来我们面前太多阻碍你的手却放不开宁愿没出息求我别离开你总是要我乖慢慢计划将来我的眼泪却一直掉下来过去怎么交代你该给的信赖被你亲手缓缓推入悬崖从我脸上的苍白看到记忆慢下来过去甜蜜在倒带只是感觉已经不在而我对你的期待被你一次次摔坏已经碎成太多块要怎么拼凑跟重来终于看开爱回不来而你总是太晚明白最后才把话说开哭着求我留下来终于看开爱回不来我们面前太多阻碍你的手却放不开宁愿没出息求我别离开终于看开爱回不来而你总是太晚明白最后才把话说开哭着求我留下来终于看开爱回不来我们面前太多阻碍你的手却放不开宁愿没出息求我别离开"));
		songList.add(new Song("爱情三十六计", "蔡依林", "胡如虹", "Savan Kotecha，Andrew Marcus Frampton，Wayne Wilkins", "城堡", "是谁说的漂亮女生没大脑只懂的爱美和傻笑你看你说话的表情多麽的骄傲难道不怕我SaySorryGetOut是谁开始先出招没什麽大不了见招拆招才重要要爱就不要跑爱情36计就像一场游戏我要自己掌握遥控器爱情36计要随时保持美丽才能得分不被判出局不必声明和他的关系不用故弄玄虚故意装神秘爱是一种奇妙的东西会让人突然不能呼吸我需要一个人静一静究竟什麽该放弃爱情36计就像一场游戏我要自己掌握遥控器爱情36计要随时保持美丽才能得分不被判出局不必声明和他的关系不用故弄玄虚故意装神秘不必声明和他的关系不用故弄玄虚故意装神秘也许这是爱情最美的关系有点爱美又有一点点距离是谁开始先出招没什麽大不了见招拆招才重要要爱就不要跑爱情36计就像一场游戏我要自己掌握遥控器爱情36计要随时保持美丽才能得分不被判出局爱情36计就像一场游戏我要自己掌握遥控器爱情36计要随时保持美丽才能得分不被判出局也许这是爱情最美的关系不必声明和他的关系不必声明和他的关系"));
		songList.add(new Song("青花瓷", "周杰伦", "方文山", "周杰伦", "我很忙", "素胚勾勒出青花笔锋浓转淡瓶身描绘的牡丹一如你初妆冉冉檀香透过窗心事我了然宣纸上走笔至此搁一半釉色渲染仕女图韵味被私藏而你嫣然的一笑如含苞待放你的美一缕飘散去到我去不了的地方天青色等烟雨而我在等你炊烟袅袅升起隔江千万里在瓶底书刻隶仿前朝的飘逸就当我为遇见你伏笔天青色等烟雨而我在等你月色被打捞起晕开了结局如传世的青花瓷自顾自美丽你眼带笑意色白花青的锦鲤跃然于碗底临摹宋体落款时却惦记着你你隐藏在窑烧里千年的秘密极细腻犹如绣花针落地帘外芭蕉惹骤雨门环惹铜绿而我路过那江南小镇惹了你在泼墨山水画里你从墨色深处被隐去天青色等烟雨而我在等你炊烟袅袅升起隔江千万里在瓶底书刻隶仿前朝的飘逸就当我为遇见你伏笔天青色等烟雨　而我在等你月色被打捞起　晕开了结局如传世的青花瓷自顾自美丽你眼带笑意天青色等烟雨而我在等你炊烟袅袅升起隔江千万里在瓶底书刻隶仿前朝的飘逸就当我为遇见你伏笔天青色等烟雨 而我在等你月色被打捞起 晕开了结局如传世的青花瓷自顾自美丽 你眼带笑意"));
	}
	
	/**
	 * 获取所有歌曲组成的集合
	 *	@ReturnType	List<Song> 
	 *	@Date	2018年8月13日	下午4:54:51
	 *  @Param  @return
	 */
	public static List<Song> getSongList() {
		return songList;
	}
	
}
